app/controllers/budgets_controller.rb

  def index
    @budgets = Budget.all
---
SELECT "budgets".* FROM "budgets"

  def show


    @budget = Budget.find(params[:id])
---
SELECT  "budgets".* FROM "budgets"  WHERE "budgets"."id" = $1 LIMIT 1  [["id", 980190962]]

  def create
    @budget = Budget.new(budget_params)

    respond_to do |format|
      if @budget.save
---
INSERT INTO "budgets" ("clothing", "created_at", "debt", "food", "housing", "income", "kids", "personal", "recreation", "savings", "transportation", "updated_at", "utilities") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @budget.update(budget_params)
---
UPDATE "budgets" SET "savings" = $1, "updated_at" = $2 WHERE "budgets"."id" = 1  [["savings", "0.0"], ["updated_at", "2014-08-05 04:11:25.996865"]]

  def destroy
    @budget.destroy
---
DELETE FROM "budgets" WHERE "budgets"."id" = $1  [["id", 980190962]]

    def set_budget
      @budget = Budget.find(params[:id])
---
SELECT  "budgets".* FROM "budgets"  WHERE "budgets"."id" = $1 LIMIT 1  [["id", 980190962]]