app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-22 18:34:58.585276"], ["name", "MyString"], ["price", "9.99"], ["updated_at", "2014-07-22 18:34:58.585276"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save