app/controllers/users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-31 14:28:49.508648"], ["name", "test"], ["password_digest", "$2a$10$EF0urZEfEkGscbZrjULp..1OHxEmsjUQOMKFDBk0YqATzZLnyipZa"], ["updated_at", "2014-07-31 14:28:49.508648"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save